---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.MacroLanguageType.VBNet
enum: Autodesk.Revit.DB.Macros.MacroLanguageType
source: html/7481402e-debc-27d2-0c96-fa6108aca851.htm
---
# Autodesk.Revit.DB.Macros.MacroLanguageType.VBNet

The VB.NET language.